// Задание 2. 5 Вариант. Вахрушев Никита РИС-26-36
#include <iostream> // Библиотека для ввода и вывода 
#include <clocale>  // Библиотека для настройки локализации
#include <cmath>    // Математическая библиотека (для powl и fabs)
using namespace std; // Используем стандартное пространство имен

int main()
{
    setlocale(LC_ALL, ".UTF-8"); // Включаем кодировку UTF-8 для русского языка
    
    double s = 0, n = 1, an = 1; // s - общая сумма, n - номер шага (счетчик), an - текущий член ряда
    const double ac = 0.0001;    // Точность (epsilon), константа, так как не меняется
    
    // При n=1 первый член равен 1. Типа double хватит для нужной точности.

    while( fabs(an) >= ac ) // Крутим цикл, пока модуль текущего элемента не станет меньше точности
    //fabs берет модуль от числа с плавающей точкой
    {
        s = s + an; // Добавляем текущий член к общей сумме
        n++;        // Увеличиваем счетчик шагов (переходим к следующему n)
        
        // Считаем следующий элемент по формуле
        an = -an * ( powl(n - 1, n - 1) / powl(n, n) ); 
        // Минус отвечает за чередование знаков.
        // Так как n уже увеличили на 1, степень (n-1) — это прошлый шаг, а n — текущий.
    }

    cout << "Вариант 5. Выполнил Вахрушев Никита РИС-26-36" << endl;
    cout << "Сумма равна элементов с 1 по " << n << ", которые удовлетворяют заданной точности, равна = " << s << endl;
    // Вывод результатов на экран

    return 0; // Успешное завершение программы
}

/* Анализ задачи
1) Исходная формула общего члена ряда ( ^ - возведение в степень ):
an = ((-1) ^ (n-1)) / (n ^ n)

2) Вывод формулы (находим отношение следующего члена к текущему):
a(n+1) / a(n) = (-1) * (n ^ n) / ((n+1) ^ (n+1))
Отсюда выражаем следующий член:
a(n+1) = a(n) * (-1) * (n ^ n) / ((n+1) ^ (n+1))
В коде эта формула записана так: an = -an * powl(n - 1, n - 1) / powl(n, n);

3) Какие нужны переменные:
s - аккумулирует сумму
ac - заданная точность
n - порядковый номер элемента
an - вычисленное значение текущего элемента

4) Логика программы:
Используем цикл while. Работаем до тех пор, пока элемент не станет совсем маленьким (меньше ac).
Так как ряд содержит отрицательные числа, для проверки условия обязательно берем модуль fabs(an).

5) Выводим итоговую сумму и количество просуммированных элементов.
*/