// Задание 1. 5 Вариант. Вахрушев Никита РИС-26-3б
#include <iostream> // подключаем директиву iostream для ввода/вывода
using namespace std; // используем пространство имён std

float formulaf (float a, float b) //пишем функцию для данных типа float
{
    return ((a-b)*(a-b)*(a-b)-(a*a*a-3*a*a*b))/(b*b*b-3*a*b*b); // вписываем формулу для вычисления выражения и возращаем результат
}

double formulad (double a, double b) //пишем функцию для данных типа float
{
    return ((a-b)*(a-b)*(a-b)-(a*a*a-3*a*a*b))/(b*b*b-3*a*b*b); //вписываем формулу для вычисления выражения и возращаем результат
}

int main()
{
    float af=1000, bf=0.0001; //обЪявляем и инициализируем перемнные типа float
    double ad=1000, bd=0.0001; //обЪявляем и инициализируем перемнные типа double
    cout<< "Float result: "<< formulaf(af,bf) << endl; //выводим результат выражения для типа float
    cout<< "Double result: "<< formulad(ad,bd) << endl;//выводим результат выражения для типа double
    return 0;
}
/*Объяснение результатов и подведение итогов:
Разница в точности вычислений между типами float и double обусловлена их внутренним представлением в памяти компьютера.
Оба типа хранят числа в двоичном формате с плавающей точкой, используя фиксированное количество бит для мантиссы и экспоненты.
Проблема в том, что многие привычные нам десятичные дроби (как 0.1) в двоичной системе превращаются в бесконечные последовательности. 
Компьютеру приходится их округлять. Чем больше памяти отведено под число, тем точнее будет округление. 
Так как float занимает 4 байта, а double — 8 байт, double считает точнее, оттого и результаты разные.
*/