//Задание 2. Вариант 5. Вахрушев Никита РИС-26-3б
#include <iostream> // подключаем директиву для ввода/вывода
using namespace std; // используем пространство имён std
#include <clocale> // подключаем директиву для использования кириллицы
int main()
{
    setlocale(LC_ALL, ".65001"); // подключаем русскую локализацию
    int n,m; // объявляем переменные
    cout <<"Введите значения n и m:"; // выводим текст
    cin >>n >>m; // вводим переменные
    cout << "1) " << (- -m - ++n) << "\n"; // выводим значение выражения (1)
    cout << "2) " << (m * n < n++) << "\n";// выводим значение выражения (2)
    cout << "3) " << (n-- > m++) << "\n";// выводим значение выражения (3)
    return 0;
}
/* Объяснение:
1) (- -m) двойной унарный минус => дважды меняет знак переменной => переменная не изменилась;
(++n) сначала увеличивает значение переменной на 1, а потом использует её значение;
в итоге математически верная формула выглдяит так:   m-(n+1)

2) n++ сначала использует значение n, а потом увеличивает его нв 1;
дальше m перемножается на n и сравнивается с правой частью выражения;
в итоге математически верное выражение выглядит так: (m*n)<(n), после чего n увеличивается на 1

3) n-- сначала использует значение n, а потом уменьшает его на 1;
m++ снчала использует значение m, а потом увеличивает его на 1;
в итоге правильное математическое выражение выглядит так: n>m, после чего значение n уменьшается на один, а знначение m увеличивается на 1
*/ 
